# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11-seg with Precise Cross-Modal Attention fusion
# Optimized for blood layer boundary detection

# Parameters
nc: 3 # number of classes
channels: 6 # number of input channels (3 for blue + 3 for white)
ch_b: 3 # input channels for blue light
ch_w: 3 # input channels for white light
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Blue light backbone
backbone_b:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# White light backbone
backbone_w:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 11-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 12-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 14-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 16-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 18-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 20
  - [-1, 2, C2PSA, [1024]] # 21

# Head with Precise Cross-Modal Attention (optimized for boundary detection)
head: 
  # Cross-modal attention fusion: optimized parameters for blood layer boundaries
  - [[4, 15], 1, CrossModalAttention, [2, 3]] # 22 P3 fusion: token_size=2 (更精细), neighbor_size=3
  - [[6, 17], 1, CrossModalAttention, [3, 5]] # 23 P4 fusion: token_size=3, neighbor_size=5 (更大感受野)
  - [[10, 21], 1, CrossModalAttention, [4, 7]] # 24 P5 fusion: token_size=4, neighbor_size=7 (全局上下文)
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 25
  - [[-1, 23], 1, Concat, [1]] # 26 cat P4
  - [-1, 2, C3k2, [512, False]] # 27

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 28
  - [[-1, 22], 1, Concat, [1]] # 29 cat P3
  - [-1, 2, C3k2, [256, False]] # 30 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 31
  - [[-1, 27], 1, Concat, [1]] # 32 cat P4
  - [-1, 2, C3k2, [512, False]] # 33 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 34
  - [[-1, 24], 1, Concat, [1]] # 35 cat P5
  - [-1, 2, C3k2, [1024, True]] # 36 (P5/32-large)

  - [[30, 33, 36], 1, Segment, [nc, 32, 256]] # Segment head